; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Lubomнr Hajda<Lord.Haarwey@googlemail.com>
; 
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&ANO"
CANCEL_BUT = "&Konec"
MAIN_DEST_DIR_LABEL = "&Cнlovэ adresбш:"
MAIN_FILE_LABEL = "&Archiv/Instalбtor na rozbalenн:"
MENU_FILE_LABEL = "&Soubor"
MENU_FILE_QUIT_LABEL = "&Konec"
MENU_EDIT_LABEL = "&Upravit"
MENU_EDIT_PREFS_LABEL = "&Nastavenн"
MENU_HELP_LABEL = "&Nбpovмda"
MENU_HELP_WEB_LABEL = "%s &Domovskб strбnka"
PREFS_TITLE_LABEL = "Nastavenн"
PREFS_UNIEXTRACT_OPTS_LABEL = "Moћnosti Universal Extractor"
PREFS_HISTORY_LABEL = "Zapisovat historii &archivщ"
PREFS_FORMAT_OPTS_LABEL = "Moћnosti specifikace formбtu"
PREFS_LANG_LABEL = "&Jazyk"
PREFS_DEBUG_LABEL = "&Adresбш Debug souboru:"
PREFS_WARN_EXECUTE_LABEL = "&Upozornit pшed spuљtмnнm souborщ"
PREFS_REMOVE_DUPE_LABEL = "&Odstranit duplicitnн soubory"
PREFS_REMOVE_TEMP_LABEL = "Odstranit &doиasnй soubory"
PREFS_APPEND_EXT_LABEL = "&Doplnit chybмjнcн pшнpony souborщ"
METHOD_ADMIN_RADIO = "%s Administrбtorskэ instalбtor"
METHOD_EXTRACTION_RADIO = "%s rozbalenн"
METHOD_HEADER = "%s Rozbalenн"
METHOD_MSI_NOTE_LABEL = "Pozn.:"
METHOD_MSI_REQUIRES_LABEL = "vyћaduje msi2xml"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Metoda rozbalenн"
METHOD_SWITCH_RADIO = "%s pшepinaи"
METHOD_NOTIS_RADIO = "Nenн InstallShield instalбtor"
METHOD_TEXT_LABEL = "%s podporuje nбsledujнcн metody na rozbalenн %s balнkщ.  Ћel, ani jedna z tмchto metod nenн 100%.  Pokud pшednastavenб metoda nefunguje, vraќte se a vyberte alternativnн metodu."
METHOD_UNPACKER_RADIO = "%s Rozbalovaи"

; GUI control functions
DOES_NOT_EXIST = "neexistuje.%n"
EXTRACT_TO = "Rozbalit do"
INVALID_DIR_SELECTED =  "%s nenн platnэm adresбшem."
INVALID_FILE_SELECTED = "%s Vyberte platnэ soubor."
OPEN_FILE = "Otevшнt soubor"
SELECT_FILE = "Vybrat soubor"
WRITE_TO = "Zapsat do"

; Common terms
TERM_ARCHIVE = "archiv"
TERM_COMPRESSED = "zkomprimovanэ soubor"
TERM_DISK = "disk"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "odkуdovanэ soubor"
TERM_EXECUTABLE = "spustitelnэ"
TERM_FAILED = "zlyhala"
TERM_HELP = "Soubor pomocnнka"
TERM_HOTFIX = "zбplata"
TERM_IMAGE = "obraz"
TERM_INSTALLER = "instalбtor"
TERM_PACKAGE = "balнk"
TERM_PATCH = "zбplata"
TERM_SFX = "Samorozbalovacн"
TERM_STAGE = "Stupeт"
TERM_SUCCEEDED = "ъspмљnб"
TERM_TESTING = "Testovбnн"
TERM_UNKNOWN = "neznбmэ"
TERM_UNPACKED = "rozbalenэ"
TERM_UPDATER = "aktualizaиnн program"

; Status messages
SCANNING_FILE = "Skenovбnн souboru na zjiљtмnн typu souboru."
SCANNING_EXE = "Skenovбnн souboru s %s scan."
EXTRACTING = "Rozbalovбnн souborщ z: "
INIT_WAIT = "Иekбnн na inicializaci instalбtora.%nProsнm иekejte."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM obrazy nemohou bэt rozbaleny pшнmo. Namнsto toho tento%nobraz bude konvertovбn na ISO CD-ROM obraz, kterэ bude pak rozbalenэ.%n%nChcete pokraиovat?%nPozn.: Tato operace zabere nмkolik minut."
CONVERT_CDROM_STAGE1_FAILED = "Chyba:  CD-ROM obraz nemщћe bэt konvertovбn.%nPokud je to BIN/CUE obraz, ujistмte se, ћe CUE soubor je sprбvnм naformбtovanэ."
CONVERT_CDROM_STAGE2_FAILED = "Chyba:  ISO obraz byl vytvoшen z %s obrazu, ale nemщћe bэt konvertovanэ.%nChcete ponechat ISO obraz pro dalљн analэzu?"
CONVERT_BIN_MISSING = "Chyba: Nelze najнt:%n%s\%s.%s%n%nOba %s.bin i %s.cue jsou potшebnй."
INIT_COMPLETE = "Inicializace %s.  Prosнm ukonиete instalбtor, pak kliknмte OK pro pokraиovбnн."
WISE_MSI_PROMPT = "Pozor:  Tato metoda pracuje jen se specifickэmi Wise instalaиnнmi balнky pro Windows.%nPokud Wise Instalaиnн proces startuje a иekб na vstup, tento soubor nenн %npodporovбn.  Prosнm ukonиete instalбtor, a %s ukonин rozbalovбnн.%n%nChcete pokraиovat?"
UNPACK_PROMPT = "Tento soubor je zbalenэ s %s kompresн, ale mщћe bэt rozbalenэ.%nJe to proto, ћe typ souboru je nepodporovanэ, anebo%nneobsahuje ћбdnй soubory na rozbalenн.%n%nChcete pшesto rozbalit tento soubor?%n%nPozor: Rozbalenэ soubor bude pojmenovбn:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Chyba: %s%nnemщћe bэt rozbalenэ."
WARN_EXECUTE = "Varovбnн:  Na rozbalenн souborщ tohoto typu musн bэt tento soubor pшнmo spuљtмnэ.%nPokud budete pokraиovat, spustн se nбsledujнcн pшнkaz: %n%n%s%n%nPokud si myslнte, ћe tento soubor by mohl bэt zбkeшnэ, doporuиuje se nepokraиovat.%nChcete pokraиovat s rozbalovбnнm?"

; Help text
HELP_SUMMARY = "Rozbalн soubory z kterйhokoli archivu anebo instalaиnнho balнku."
HELP_SYNTAX = "%nPouћitн:  %s [/help] [soubor [umнstмnн]]"
HELP_ARGUMENTS = "%n%nPodporovanй argumenty:"
HELP_HELP = "%n     /help%t%tZobrazit tuto pomocnou informaci"
HELP_FILENAME = "%n     soubor%tJmйno souboru na rozbalenн"
HELP_DESTINATION = "%n     umнstмnн%tAdresбш, do kterйho rozbalit"
HELP_SUB = "%n%nPassing /sub instead of a destination directory name instructs%n%s to extract to subdirectory named after the archive."
HELP_EXAMPLE1 = "%n%nPшнklad:"
HELP_EXAMPLE2 = "%n     %s c:\1\priklad.zip c:\test"
HELP_NOARGS = "%n%nSpuљtмnн %s bez argumentщ%nvyzve uћivatele na zadбnн nбzvu souboru a cнlovйho adresбшe.

; Error messages
CANNOT_LOG = "%s rozbalenн nemщћe bэt zapsanй."
CANNOT_DEBUG = "Adresбш umнstмnн debug souboru, "%s", neumoћтuje zбpis.%nNamнsto toho bude pouћitэ doиasnэ adresбш."
CANNOT_EXTRACT = "%s nemщћe bэt rozbalenэ.%nTyp vrбcenйho souboru: %s%n%nKliknмte na ANO pokud chcete analyzovat soubor, anebo Konec na ukonиenн."
UNKNOWN_EXT = "%s%nmб neznбmou pшнponu anebo nemщћe bэt rozbalenэ."
INVALID_DIR = "%s%nnelze vytvoшit. Vyberte sprбvnй umнstмnн."
EXTRACT_FAILED = "%s nemщћe bэt rozbalenэ.%nVypadб to, ћe to je %s, kterэ je podporovбn, ale rozbalenн zlyhalo.%nPodнvejte se do logovйho souboru %s pro vнce informacн.%n%nKliknмte na ANO na prohlйdnutн logovйho souboru, anebo Konec na ukonиenн."

[Installer]
; Components page
COMP_DOCS = "Dokumentace a licenиnн informace"
COMP_LANG = "Jazykovй soubory pro mezinбrodnн podporu"
COMP_ACE = "Podpora pro ACE soubory"
COMP_KGB = "Podpora pro KGB soubory"
COMP_PEA = "Podpora pro Pea soubory"
COMP_SIT = "Podpora pro StuffIt soubory"

; Preferences page
PREFS_CAPTION = "Nastavte moћnosti programu"
PREFS_DESCRIPTION = "Kterй moћnosti chcete nastavit?"
PREFS_LABEL1 = "Mщћete nastavit nбsledujнcн moћnosti na pшizpщsobenн pшednastavenйho chovбnн programu."
PREFS_LABEL2 = "Tyto moћnosti mohou bэt zmмnмny po instalaci modifikovбnнm UniExtract.ini."
LANGUAGE_LABEL = "Pшednastavenэ jazyk"
DEBUG_LABEL = "Umнstмnн Debug souboru"
APPEND_EXT_LABEL = "&Doplnit chybмjнcн pшнpony souborщ"
HISTORY_LABEL = "&Zapisovat historii archivщ"
REMOVE_DUPE_LABEL = "Odstranit &duplicitnн soubory"
REMOVE_TEMP_LABEL = "Odstranit &doиasnй soubory"
WARN_EXECUTE_LABEL = "&Upozornit pшed spuљtмnнm souborщ"

; Tasks page
ASSOCIATE = "&Povolit integraci do kontextovйho menu Exploreru"
ASSOCIATE_FILES = "Pшidat UniExtract &soubory... do kontextovйho menu"
ASSOCIATE_HERE = "Pшidat UniExtract &zde do kontextovйho menu"
ASSOCIATE_SUBDIR = "Pшidat UniExtract do p&odadresбшe do kontextovйho menu"
ASSOCIATE_FORCE = "Vynutit &asociaci se vљemi podporovanэmi formбty archivщ"
MODIFY_PATH = "Pшidaќ Universal Extractor do systйmovй &cesty"
DESKTOP_ICON = "Vytvoшit &ikonu na ploљe"
QUICK_LAUNCH_ICON = "Vytvoшit &ikonu v panelu Rychlйho spuљtмnн"
SENDTO_ICON = "Vytvoшit ikonu Odeslat&kam"

; Context Menu integration
EXTRACT_FILES = "UniExtract &soubory..."
EXTRACT_HERE = "UniExtract &zde"
EXTRACT_SUB = "UniExtract do &podadresбшe"
